// Вывести квадрат числа 
Console.WriteLine("квадрат введенного числа равен");
Console.WriteLine ("Введите первое число");
int a = Convert.ToInt32(Console.ReadLine()); 



System.Console.WriteLine(a*a);

// финиш !!!
