// Вывести квадрат числа 
Console.WriteLine("квадрат введенного числа равен");

int a=5; 
//Console.WriteLine ("Введите первое число");
// = Convert.ToInt32(Console.ReadLine ());

System.Console.WriteLine(a*a);

// финиш !!!
