// Даны два числа. Показать большее и меньшее число
int a = 5;
int b = 7;
max = a;
if(b>a); max=b;
Console.WriteLine(max);
